#ifndef RTOS_H
#define RTOS_H

/******************************************************************************************
 * За основу взят планировщик задач с сайта ChipEnable.ru                                 *
 * http://chipenable.ru/index.php/programming-avr/item/110-planirovschik.html             *
 *                                                                                        *
 * Доработал Шибанов Владимир aka KontAr                                                  *
 * Дата: 26.03.2014                                                                       *
 *                                                                                        *
 * Изменения:                                                                             *
 * - добавлен однократный вызов задачи                                                    *
 * - добавлено удаление задачи по имени                                                   *
 * - при повторном добавлении задачи обновляются ее переменные                            *
 * - добавлен указатель на "хвост" списка                                                 *
 * - функции РТОС скорректированы с учетом "хвоста"                                       *
 ******************************************************************************************/

#include <commons.h>
#include "Separ.h"

#define MAX_TASKS      9               // Количество задач
#define RTOS_ISR       TIMER0_OVF_vect // Вектор прерывания
#define TIMER_COUNTER  TCNT0           // Регистр-счетчик
#define TIMER_START    6               // Константа для таймера Т0


/******************************************************************************************
 * Структура задачи
 */
typedef struct task
{   
   void (*pFunc) (void);               // указатель на функцию
   u16 delay;                          // задержка перед первым запуском задачи
   u16 period;                         // период запуска задачи
   u08 run;                            // флаг готовности задачи к запуску
}task;

/******************************************************************************************
 * Прототипы фукнций
 */
void RTOS_Init (void);
void RTOS_SetTask (void (*taskFunc)(void), u16 taskDelay, u16 taskPeriod);
void RTOS_DeleteTask (void (*taskFunc)(void));
void RTOS_DispatchTask (void);


#endif
